Table of Contents
 Interface IIdeaSection
Namespace
IdeaStatiCa.BimApi.Results
Assembly
IdeaStatiCa.BimApi.dll
Section of IIdeaMember1D or IIdeaElement1D with results.
public interface IIdeaSection
Properties
 Position
Position on IIdeaMember1D/IIdeaElement1D. Value must be within 0 and 1 (including) where 0 is the start and 1 is the end.
double Position { get; }
Property Value
double
 Results
Results on the section.
IEnumerable<IIdeaSectionResult> Results { get; }
Property Value
IEnumerable<IIdeaSectionResult>
 Edit this page